{
  "projects": [
    {
      "id": 1,
      "title": "Campaign Craze",
      "description": "Campaign Craze provides a comprehensive view of influencer content within campaigns, offering a visually engaging and data-rich experience showcasing an image carousel with influencer info and campaign performance with insightful metrics.",
      "details": "Campaign Craze is built with react and utilizes dynamic lazy loading for infinite scrolling, ensuring images load seamlessly as the user scrolls. This design guarantees a smooth and efficient experience across various screen sizes, providing a clear and insightful view of influencer campaign performance.",
      "image": "https://raw.githubusercontent.com/shetdisha94/mock-front-data/refs/heads/main/project-screnshots/campaign-craze.png",
      "stack": ["HTML", "CSS", "JavaScript", "React"],
      "links": {
        "github": "https://github.com/example/portfolio-website",
        "liveDemo": "https://example-portfolio.com"
      }
    },
    {
      "id": 2,
      "title": "Portfolio Website",
      "description": "My portfolio website is more than just a collection of projects; it's a digital narrative of my journey as a Frontend Developer, a story told in code and design. ",
      "details": "Designed with a sleek, contemporary aesthetic, it invites you to explore my skills, experience, and the passion that fuels my work. Experience the flexibility of switching between light and dark themes. This website is a reflection of my dedication to crafting impactful and user-centric digital experiences highlighting my technical capabilities and creative vision.",
      "image": "https://raw.githubusercontent.com/shetdisha94/mock-front-data/refs/heads/main/project-screnshots/Portfolio.png",
      "stack": [
        "Vue.js",
        "Tailwind",
        "Nuxt.js",
        "TypeScript",
        "Server-Side Rendering (SSR)",
        "Client-Side Rendering (CSR)",
        "SEO"
      ],
      "links": {
        "github": "https://github.com/rameskum/ecommerce-admin",
        "liveDemo": "https://ecommerce-admin.computerbyte.in"
      }
    }
  ]
}
